["Flair your posts! It helps with organization as we can then design filtering for different idea types.","Idea: A nursing/retirement home where lonely old people are given unwanted pets from animal shelters to keep them company","Instant \"police come here\" function","Reverse Ideation (requesting input on how it might work!)","Have all auto manufacturers agree upon a standard for blinker speed.","A standard touchpad, or mouse, for that matter, should have an extension ctrl and alt key in addition to mouse buttons.","Halloween Candy Bag Calculator","A better way to look at color?","Unshittable thongs","A dashboard indicator in my car that tells me what the speed limit is.","Tell-tale/chose your own adventure video game mocking reality tv.","need a title for assignment","A way for developers to constantly improve a video game's levels in updates without losing player progress by using a time machine-like UI to allow players to go back to deprecated/tweaked levels.","A restaurant for college students or young adults to eat healthy.","A Halloween App that Helps Plan your Trick-Or-Treat House Route","A news website where you can only reply in memes","How to make this chair more comfortable?","Save evidence with a credible date","Captcha Photos of Greeting Gestures","I'm stocking up some cool funny \"gigs\" for a local experiences website. I'm running out of ideas and need you help.","The Auto Trash Can","A bot for teaching the art of social conversation.","Any game that puts up text during loading screen should always have it switch text by pressing a button, not a random timer.","Phones should have a “Reverse Do Not Disturb” function, where you can choose to send a message without triggering a notification on the recipient’s phone.","If a train is delayed in Japan they should issue paper Chits to you when you ‘Arrive/Get To’ your normal station. Issuing them when you disembark isn’t as useful.","I had a stroke of culinary brilliance just now.","Use drones to change lightbulbs on highways","A polling system built into reddit. For example, if the OP turns this option on, people can vote left or right to pick a side on whatever OP asked a poll on. This would be separate from the updoot system.","A \"smart start\" feature on fantasy football apps that automatically starts the players with the highest projections","Abandoned Shopping Malls would make great homeless shelters.","Laptops and phones should have a privacy switch that physically disables the microphone and camera","A zombie movie set in Arlington National Cemetery.","A ghost writing tool where spoken text is improved in speech and written down in text form.","Predictive health suggestions based on your genomic, fitness, and diet data","When comparing past year prices with today standards, we should measure prices by % of the average wage instead .","Car Charger with Audio Out","A game like Cities Skylines where you have to build a city, but also make sure it can be defended during a war.","What are some other recognizable pieces of art similar to Bold and Brash from cartoons in the early 2000s","HBO should make a series out of Skyrim","Flavoranges, \"oranges\" with the peel and slices inside but the slices are jelly/flavored pulp","An 'It' movie with a broad storyline with Tim Curry as the 80s Pennywise who battles the 2017 Pennywise","Dress kit for stuffed animals, ?monthly?","Wasted Night Syndrome","Combined page of /r/jokes, /r/antijokes and /r/antiantijokes","There should be a concierge service for office buildings that pick up food, laundry, shit out of your car, gas...etc","Supermarkets should use rfid chips for their products to speed up the process at the cash","Have subtitle settings to make the subtitles have a delay after what is spoken so that if the viewer doesn’t understand what was said, they can look down at the subtitles before it changes to the next piece of dialogue","Freemium games that give you a random number of credits within a certain range when paying for them using real money. For example, you could pay $4.99 for 1,000 to 10,000 with the actual amount determined randomly after you make the purchase.","Bear Down for Midterms","Witches of America: You should collectively go to Texas, Puerto Rico, California, Washington, etc. and perform peace/hope/solace-related spells to bless the land.","Optional Art to Accompany Audio Books","There should be stamps that are resealable with nfc chips in them so that anyone can reuse them and pay for shipping.","Hearing aid ads should focus on how RUDE it is for someone to refuse to wear a hearing aid even though he/she can easily afford one and would benefit greatly from one.","Toilet Target..yeah it’s what it sounds like","Put arms on all drones and have a \"wave\" button on the controller to seem less threatening to unsuspecting people.","A webpage that mimics the sunrise by starting dark and slowly lighting up over time (like an alarm clock). People could use it to help wake up in the morning.","An OOBE simulator...","A shared whiteboard for instant messaging apps, like MSN had back in the day.","I'm a terrible cook. I want there to be a \"Couch to 5k\" think, but for cooking.","A subreddit where you come up with cool movie lines and/or insults that would otherwise not get used","The check engine light should have two colors: Green when it something minor like a bad sensor and red for when something is really messed up.","Protecting the environment without killing the working class through a New New Deal.","Something like the renaissance fair, but for ~1930's America instead","There should be a dating site that matches people based on marital benefits.","AR Graffiti App","Useful Software Project Ideas List 2017 v.01","There should be a festival for every cultures pre industrial age!","Backup cameras that use augmented reality for the guidelines. Also add a chaperone (like the vive has) for vertical objects.","I'd read about the tourists rescued in Utah after GPS had led them to impassible roads: add the utility to GPS to alert rescue services.","Recreate the 1960s Batman series as cartoons using original audio for voice actors.","Allow on call emergency service staff to jump the queue, so they can get food and drink before they spend their day helping people.","A shelter for lonely people where they can go and talk to each other for a few hours.","Chrome extension for landlord reviews","listen to your own music while on hold","AR for cooking","A zombie novel/movie where the zombies occasionally say something true that was previously unknown by humanity and never say anything false.","Any current major sport on a triangle court with basically the same rules and three teams playing at once.","Inflatable tennis balls","This one requires you to do most of the thinking. Everything we use should be 5, 30, 2, 10, repeat.","Bot Forge: a reality show where in the first half the contestants forge blades and armor, then in the second half they mount them on robots and battle it out","Twitter should make a “why we banned/blocked ____’s account” account so we don’t have to get our pitchforks out every time they do.","There should be a key on any keyboard that replaces half the space key, and it types the last character typed. That way, it allows faster typing on keyboards for words with double letters (e.g. letter, bubble)","Chess - But let each party arrange the figures as they like within the two common lines before start","The post should offer a \"Receive letters as scanned pdf by email\" service","Add minigames such as Ludo or Go Fish to your Tinder app, So you can play games with your tinder match as an icebreaker","A real estate agent where you sell your own house and you become the rental tenant, so you can short your own house","Nature documentaries with your fave animal - www.creaturefeatured.com","Documentary : The world of dance.","Nuke Yellowstone","Tinder for clothes. Swag Swipe.","Buy two packs of different flavored Oreo cookies. Pull all the cookies apart, and reassemble just the sides with frosting on them to their opposite flavored counterparts. BOOM. You now have delicious, multi-flavored, Double Stuff Oreos (with a bonus pile of plain chocolate wafers on the side)","Stop wasting those small slivers of Bar Soap. Put them in a container with a pump so you can create liquid handsoap with them.","A Facebook extension that can tell you if one of your friends or family is racist.","An app that gives you a new album to listen to everyday.","Get empty seashells and seasnail shells from restaurants for free, sandblast them and sell them as alternative to pebbles at house entrances","a website where you can type in just about anything that you want too se in a movie and you get recomendations on movies based on your preferences.","Chess vs centipede: One player has the normal chess pieces while the other has a 16 segment centipede. Capturing a segment in the middle of a centipede results in two centipedes that can be moved independently.","When you are using a complicated program on your PC you should be able to push a button, then ask for a function which then will be highlighted automatically","A game of chess with 32 players, with each player controlling a single piece. Give it a funny name like Bureaucracy chess.","Luxury R.V. Resort","A Netflix or TV app which slowly reduces the volume and brightness.","New app ideas for 2018","A device that smells farts and suggests how the farter might improve their diet.","A membership-based grocery store","An online service where cars share their outdoor temperature sensor data for more accurate weather info.","Microgrid communities built for mobile homes","An alarm clock that wakes you up by saying a customizable list of your favorite things.","Portable ice and cup","A T-shirt that says: \"Can you smell the rock that I'm cookin?\" with an iconic picture of The Rock but with missing teeth.","Credit cards with smaller profiles","Single pill dispensing prescription bottle caps","A Party Cup","User curated learning resources for any topic!","Students should be taught that advances in computer science and software engineering make it possible for creative indie devs to build amazing apps on their own — working as part of a team is no longer required.","A mobile poker app using AR. Everybody can see the chips on the table, and the table can be transformed into different styles (basement, Vegas, riverboat, etc.)","Documentaries should include visual indicators when footage is staged, computer-generated, or re-created.","An extension very specifically for downloading twitter/tumblr images at their max resolution.","Gore rating system","A HelloFresh-type service that just has Crock Pot meals.","put pictures of animals getting cut to pieces on meat packages so people stay grounded and don't forget what they are really doing.","We should have a world government.","CS/SE degrees should be replaced by CS/SE transcripts since software development doesn't require degrees and transcripts provide more useful information.","the multi use nature of the laptop, while very convenient, makes users excessively prone to distraction. A solution could be to start building smaller modular computers with simpler functionality. Modeled after analog machinery and specifically analog music gear. Applications in music production..","Web Conferencing for Dummies","Jetliners should give passengers real-time estimates of the probability of a crash based on current flight conditions, historical data, and pilot skill. Such estimates could calm passengers down during turbulence, crosswind landings, etc.","A progress bar on .gifs so you know how much time you're committing to.","Band-Aids should come on a roll, like Scotch tape.","Spotify on multiple phones","A subreddit for comments on the internet that start with \"ah yes,\"","A Mashup TV Show - \"It's Always Sunny In Portlandia\".","Anime Mirrors in Gyms","Pay prisons by the time ex-inmates stay crime free after release (x-post from r/crazy ideas)","Physicians Salary, while among the highest, should partially consist of the success of the treatment of a patient","Google Play Store should have options to arrange apps in decreasing order of number of downloads and in increasing order of size in MB.","Home computer system that would be seamless","Curated Learning Guides to share and master anything","Buttons on the outside of the elevator on each floor","Incentivize private prisons to provide positive outcomes for ex-convicts and society: Pay them only for ex-convicts living successful, productive lives. The prisons decide length of terms, but are responsible for the internment costs.","To complement headphones, create \"feetphones\" and \"armphones\" and \"beltphones\"","what if you stop calling it \"texting and driving\" and call it \"distracted driving?\" it gives it sort of a \"drunk driving\" or \"driving under the influence connotation.\" maybe if there was a way to incorporate technology or screens into the phrase, that'd help too.","Engrave in a cheep, long lasting, heavy, disaster proof structure, how to build a computer, read a harddrive, and gather data from our computers so that if we have a cataclysmic event, that future generations might be able to access our harddrives or SSDs.","Create a DMV-esque government body for guns and gun-owners, complete with licensing and registration.","YouTube history explorer","CodeBono, free web development for causes you care about","Social media should alert you if someone you are connected with is in the vicinity of a shooting, natural disaster, etc.","There needs to be an equivalent internet trend to ice bucket challenge where people hand in their guns","More exclusive purpose currency. Welfare money can only work for basic needs. Child support money can only go to basic needs for the children.","Stovetop webcam that clicks into your range hood, sending a live-feed to your computer so you can leave your whatever that needs ten minutes to boil without worry.","IR Master: Control any IR based device with any IR remote.","[Idea] Disaster Recovery Blimps.","A realistic simulation where you rescue hijacked jetliners by boarding them in midair, taking out the hijackers, and then landing the plane.","A device that creates a melody of taste","Mobile power station to PR","What do you think about a webapp with curated, crowdsourced learning guides and links?","[Meta]Actually let us easily apply flairs for posts","Mobile phones that will automatically pause your call whenever you are speaking too loudly into the phone and hence being a nuisance to others (e.g., in a fast-food restaurant).","With the inevitability of self driving cars, upon being stolen, they can lock the thief in and drive to the police station.","Protest organization site","A media service that notifies you of new episodes, albums, movie releases.","Cars should list the songs that are being played on the radio station in stead of the station names","Netflix should have a \"I'm feeling lucky button.\"","To prevent injustice in the judicial system, the accused should remain completely anonymous, until convicted","The DMV should have a webcam so we can see if there's a giant line or not","Start a campaign similar to uber for pilots in Florida/Caribbean region to donate money and supplies, and once the donation to cover gas, maintenance and a plane full of supplies the pilot flies off and provides them to Puerto rico.","A weapon that can be aimed and discharged behind cover","A site/app that you link to your Netflix/IMDB/Steam/Metacritic profile, and it tells you which critics you most agree with.","Fastforwardable and Rewindable GIFs","A consumer goods company that produces whatever the majority of people vote for","A cupboard/shelf fixed to the ceiling and that can be lowered to access its items. saves space","A Dip-Based Restaurant","A database of jokes, so we have a record of which comedians originally came up with what joke","Airlines should serve checked bags based on earliest tonlatest check In. This will encourage people to show up to the airport earlier.","A Modular Wall","A website that gives you gift-recommendations based on a friends social media likes and dislikes.","Sports-based videogame where you play as the camera operator.","Mental Wellbeing band","A bot that uses neural nets to determine the trends and variables affecting karma on reposts on reddit and automatically post reposts that would attain most karma at any given point time","Food packages should say whether or not dogs can consume safely or not.","Videogame from a referee's point of view","An online chat that isn't full of horny people showing their genitals around","Disposable Cars","Abolish Daylight Savings Time.","Idea: comic page about A/B testing, and then have it that the comic and the punchline panel are changed via A/B testing.","Pool shaped like an eye.","Traffic Lights that Flash","A user login system that has one or more additional passwords for the same user that will log them in to a pre-specified guest like session.","A youtube feature: When someone 'dislikes' a video, any comments they make on the video is red, so that future video watchers can maybe parse out why they dislike the video...","A browser extension that mines crypto-currencies for you","Electric Cars with replaceable batteries","Idea for car manufacturer to help reducing hotness when park under the sun","Battery case for the MacBook or the MacBook Air","A Fresh bacon delivery service.","Crowd-sourced Borrowing/Lending Platform","20% time that allows you to have all ownership rights over your side project for as long as it remains your side project.","Eraser caps for mechanical pencils","Blog Idea","Which Zoos have Which Animals?","Computer Cubes (cluster computing)","Spotify Data","Smartphones etc. should be able to know if you have unlimited mobile data, so apps can avoid those \"you may incur charges\" or \"please turn on mobile downloading\" alerts.","Currency distribution software that makes money for everyone.","A physical windows volume mixer","imDB for animals so you can see what nature documentaries your favorite animal has been in.","A backpack which massages your back.","A Game Of Thrones-budget show about the American Revolution, going through American political history, showing how ugly things got and how hard certain people had to fight","Pet Hotel: Lonely travellers can take a pet of their choice with them in their rooms (dog,cat,rabbit,..)","There should be a place where you can watch spoiler free trailers edited by people who've already seen the movie","Netflix should start adding children's shows on saturday mornings, so they can literally announce saturday morning cartoons.","A charity where people can donate part of their lawn to be a garden that gets taken care of by the charity and all the food goes to the poor.","Freemium games where you can get credits without paying real money if you design and submit new levels that become popular and are rated highly by other players.","Redtooth Unsecured Audio","An app that substitute politicians!","Facebook posts should have a fake Button in addition to like etc","Imagine bike-powered video-games","Utilize VR car simulator in drivers ed classes","A live chat subreddit for tutoring","A subreddit to enable teams to form around ideas like those posted on subreddit like this one","A real-life escape room where you have to program your way out. Only one person in the group needs to be a programmer.","An average speed monitoring system which donates a few grains of rice (or equivalent) to those in need for each driver who sticks to the speed limit","A service that turns your lawn into a potato garden.","All cars should come with a standard feature that warns you if you're in reverse for too long","A door that lights LED's when someone knocks on it.","An application for farmers for alternate income.","A website that crowdsources things to do around your city/country.","Mobile phones should have a 'travel mode' that deletes data while crossing international borders","Books that teach history in a dramatic (but accurate) way.","Possibly save millions of gallons of water for the whole world","A button on an aquarium that makes the decorations bubble. A bubble button.","Experts vs Idiots, a tv show where experts in a given field (e.g crime scene investigators, car mechanics, etc) are paired off against random people off the street and their answers are compared.","A new function for search engines- Viewpoints","Illustrate WW2 using an interactive video-graphic which combines features of RTS games (Starcraft/Command &amp; Conquer) with 'The Scale of the Universe 2'. The Macro level shows entire armies from training to deployment and the Micro level shows famous weapons or soldiers (Yamato/Enola Gay).","Any game show ideas?","create a \"Tall Morty\" bot that translates random text on reddit into \"Gragitian\"","A game show where people fake a murder, and try to make it so nobody can realize who did it, then a real forensic squad tries to find out who did it.","Cell Phone Feature Request","Car manufacturers should make a bluetooth-enabled car diagnosis app","A TV drama about the discovery of the cure of cancer (or something of that magnitude) and all the implications it has for the individual who discovered it and external interests.","Kid friendly evening news option","Our subreddit is trending!","Implants that are like credit cards, tickets and beacons, all in one, based off of Black Mirror.","[Idea] A Protein-shake &amp; Smoothie Food Truck","Morality in Music","Funnt tv show dub idea","The Wicked Whip Zip-It","A baby's bottle that instead of being made from rigid plastic, it made with a bladder (like CamelBak). This would prevent colic since there would be no pressure build up as the baby drinks.","An app called Welp","TV show idea","An app that you can search to see if the idea you've come up with already exists or not.","Obsidian razors","Night time pizza delivery","[Rip off from showerthoughts] make a t-shirt with a random person's face and the caption under the face \"not my president\"","A computer AI network that generates new episodes of TV shows by analyzing and compiling all the other episodes.","Graphene single-photon detectors","Every baby born be assigned a plant that'll grow in to a tree.","\"No Purchase Necessary\" automatically fills out whatever it takes to enter giveaway.","A location app where people in the same area can connect to the same song at the same time","App or program that would suggest music based on the notes, keys and chord progressions of your favorite songs.","Open source uber","A bed that goes under a desk.","I think that the adherents of abrahamic religions need a bit of help to develop some trust among themselves","Video landing pages for professionals","Fix the html of this subreddit so I can click on my account again when I am here","business idea","Replace the rear-view mirror in cars with a tri-directional screen and three cameras?","A Kickstarter \"Petitions\" section. Someone posts an inkling of a project, others vote how much they would pay for it. That would help connecting those who have the means of fulfilling it and those who want it fulfilled.","If you combine flexible screens with augmented reality and make it wearable like glasses, then there would be no reason for any kind of screens.","Google maps but with a slider that lets you go back in time to see things like Yugoslavia, USSR or even things like British Raj.","Snapchat face recognition should be built for dogs and cats with their own set of face filters","Illustrated audio novels where the illustrations are contributed and voted upon by readers.","Have schools/colleges educate people/students about the dangers of multi-level marketing schemes/pyramids","An online public directory of all the worlds waste","An app for storing stuff.","A trading website with what you want to trade and what you're looking for","Hike the corporate tax rate way up to pay for universal income / social services. Give hefty rebates based on number of employees and median salary.","Give conservatives cameras, and tell them to go to any random Canadian town's hospital, and film all those horrible waiting lines.","An app or website that lists what songs were on all radio stations, categorized by time","A DIY kit for escape game-like activities","[PC gaming] Command Hub","Storm Killer Submarine Squad","A flat rollable pen that is the same shape as your credit card.","An app to determine an equidistant yet fun hang out spot for when you are trying to meet a friend - especially useful in a city.","Agriculture light filtering.","Apps to motivate people to walk or bike more: City PacMan or PacMan knock-off","A TV show where fireteams of 3-8 people drawn from military vets and ex cops/swat attack eachother with advanced Simunitions on elaborate battle courses.","An FPS that requires you to *program* how your character behaves 80% of the time. Manual control would be a limited resource to be used only when you think your code would not do well.","Houseplant care/consulting: I have a \"black thumb.\" Come to my home, tell me which plants meet my needs, let me pick out plants/pots/sizes, return with plants potted and detailed instructions for taking care of them","Something like a 12-step program to support people dealing with loneliness and social anxiety issues","RemindMe! Bot upgrade","Bank Cards should use a QR Code to store information. The current contacts of the chip get damaged easily","homes in LA and should have Cacti instead of Lawn Grass","Browser extension that saves timestamps of a (Youtube)video and then lets you jump through them.","A restaurant that only does birthday parties. Each day there's one big party and one big cake for everyone sharing a birthday.","An app that allows you to block any app for a set period of time.","Alternative to Health Insurance - Assurance, purposeful community saving using member's accrued fee's interest a means of payment against Health Care Providers.","Signs/Billboards with secret messages you can only see by taking a photo of it","Ok, x-post from /r/CrazyIdeas because I didn't know about this sub: An app called Whiskr that is laid out similar to Tinder, except it's all cat pictures and you swipe based on whether you like the cat. Meeting up not necessarily necessary.","All passenger seats in a car should have noise cancelling headphones for protection from loud talking/shouting from within the car.","A service that purchases, tracks, and syncs an eBook AND its audiobook, so you can effortlessly transition to reading and listening your book.","Airbag alarm clock.","A car designed to expand to add a second row when needed. You have a modern sports car and a family sedan in one. It just retracts from itself and folds from the trunk. Similar to the VW Eos's sunroof.","a software thing that makes videos into podcasts .","A good name for a really decadent sun butter you made would be \"sin butter\". Or one you jizzed in.","A Netflix series of different TV pilots, where the most popular episodes get their own series","What do you guys think about a curated, crowdsourced guide to learning things?","Reddit should have an optional 'seen' feature which hides posts that you have looked at or marked as uninteresting.","App that helps you memorize stuff for school...","App that allows you to show your own 3D designs (SketchUp, Cinema 4D, etc.) in AR using Apple's ARKit","Portal Long Fall Boots IRL , not for Falling , for Running .","An NBA Videogame that is actually fun - instead of focusing on realism, chooses to include dramatically satirical superhero versions of current NBA superstars with corresponding superpowers/special moves","Create The Netflix of Social Media","\"End of Days\" would be a good name for a bar or club.","Someone should make a Rick and Morty reimagining as an 80s sci-fi sitcom.","A button on your headphones that removes the current song from your playlist","Live Online Group Classes","While installing Windows, instead of having the user sit next to the PC and answer questions after every restart, the installation should ask all questions at the very start so that the user can return to a working PC.","Unique, Visual Task Manager","Heated Jacket... also a heated sock idea","A subreddit for coming up with silly album names.","An Air BnB feature which allows users in disaster areas to offer their homes to stay in for free.","Direction tag on fitted bed sheet","Infinite hydroelectric power from hills/springs?","DisasterAdopt: An app/website where users post pictures of their home and they can \"adopt\" people who need to evacuate or are in the path of natural disaster by inviting them into their home.","Phone application that uses the same program style in Photoshop style image programs to identify colors in specific areas of an image to help color blind individuals.","Add a button to alarm clock apps for \"tomorrow is a holiday\"","[Data Mining] Write a program that uses /r/WritingPrompts to determine what makes a \"good\" story.","A font where there are multiple versions of each letter and they are picked at random; for more realistic hand-written fonts.","A sub reddit where couples can post their sides of the argument and the public can decide who is in the wrong.","We should get rid of routine traffic stops.","A game that goes through a lot of technological development throughout the game, and allows sorts of \"governments\"","Zoos with pandas should sell churros that look like bamboo stalks","A function in Spotify or streaming music app to tell you how many people are listening to that track right now.","A trash can that separates different materials into different bins that make recycling easy.","Subreddit where users submit np links to petty squabbles they've gotten in across reddit, and the users decide who was right.","Add low doses of UV to Office Light. Ppl will get tanned and have higher Vitamin D levels","Make an option on Netflix similar to the kids area, but for seniors. Have it stocked with old war films and westerns.","We Should Just Invade Mexico (hear me out)","Reverse Karaoke , where there are *only* Vocals and people have to play the instruments","A chat-room with extra features for tabletop games","An idea about the Monument Conflict in America","Sketch where the Illuminati discuss various the planning conspiracies (and inadvertently explain why they don't add up)","Make Video Montages on Youtube of specific moments from movies and TV shows, such as scenes where characters are cooking food, or moments when people are reloading or cocking guns.","A hand-rechargable-torch-like-device except it makes a spark for starting a fire","To be able to turn off auto-notifications on phones so that you can turn on your phone to do something without getting distracted by all your notifications.","When you call someone on FaceTime and they don't answer let me leave a video message.","Six Flags model roller coasters","Gloves with pockets.","Avocados should be GMO'd to have no seed","Chat apps and email clients should allow you to send corrections, but only for correcting typos","An augmented-reality app that shows you the driving reputation of every car near you based on its license plate. To report poor driving/behavior, just tap on the car and that car's reputation goes down in the app.","Compact Popcorn Popper Using Heat Gun","Teach most people computer programming by having freemium games that accept a personalized demonstration of programming ability as an alternative to payment for obtaining credits in the game.","A workplace coffee machine that takes a pic of whomever is taken the last coffee and then displays it on a little LCD display","App that plays music you like to the porn you watch","A cladogram of all life that lets you zoom in like on Google maps.","Instead of solid dashed lines, lane markers should be numbers so drivers always know the speed limit.","Have a choice of sounds for your carhorn","Google Maps should display how long the drive through is at Dunkin Donuts","When you click a Googe search result it should take you to the words you searched for.","Modern train engines are monster electric generators...","A service that pairs you with someone who will take care of your house completely provided that they would eventually inherit it from you. Such a person would inspect the house weekly/monthly, decide what needs to be done, and do it or pay people to do it.","A clear popcorn bag so that you can watch the kernels pop!","They should have an hour long show every day on every major news station that refuses to talk about politics","Gin Isotonic, the perfect way to get wasted after working out.","A game like PUBG except as a 2D flash game so you don't need a really good computer to run it","A \"friendly\" warning light for tailgaters","A pop-up meme museum","a system of representing Numbers via Words","Just Watched It Follows, now imagine this...","Idea: P2P Disaster Relief Funding (see link in body)","A browser extension that shows the political bias of news sites.","GM should revive Saturn as an All-Electric Vehicle brand","Develop jacket with airbags for protecting elderly people when falling","A contraction of \"with\" and \"the\" spelled withe","A monowheel drive that drives your shopping cart","Side-Effects of medicines of the should also include their average duration when stated in the package insert","Train Tracks on Hills .","A camera app that gives a subtle vibrate/'tab' feel when the phone is perfectly level","Need an idea for my marketing class!","Someone should put a gopro camera on a shot/beer girl and make a youtube channel.","Crowd funding that redistributes the profits after the goals are met and backer obligations are fulfilled.","LET'S PLAY A GAME","The main GoT cast members should be suited with top notch private security to keep them alive until they finish production.","Youtube needs a \"play this video next\" button on each of the related videos.","Shazam should have a feature that lets you know you've already shazamed a song so you dont do it time after time","Reddit should replace their search engine with Google Custom Search engine","When you meet your friend at your regular food stop pretend like you're secret spies exchanging briefcases and documents. Get the restaurant staff wondering...Just for fun.","Soulful Socks for women","Youtube should have a shuffle playlist button","Brake lights should transition/fade from light orange to dark red depending on how hard the driver is braking.","Color of the public buses should depend on the district they drive from city centre.","Mint aggregated financial statement","A bot or something that when summoned will search a database of scripts and song lyrics to tell you where the funny quote that was commented is from.","A|\\| aPp th@+ $&lt;rambl€s y0vr t£xt l|ke th[$ to keep it from being searchable.","Sun lotion dispensers and/or hand lotion dispensers in public and private bathrooms","Destroy The Annoying Indian Scammers","Encourage computer programming in high school by allowing students to submit a computer program they wrote to compute the answer to any homework assignment in any subject.","An application combining project planning and service bidding","A marco polo type app that can respond to voice commands to help me find my phone","Would people be interested in a monthly iPhone case subscription box?","A digital gas gauge that would display how many gallons are needed to fill the car in order to take the guess work out of prepaying","Simple idea: radio with dvr.","Put wind tubines on top of power poles rather than builing seperate poles for them.","Elevators should have touch screen controls, both inside and on each landing. The screens would show bigger buttons for the most popular floors, estimated wait time, floor info, and accept spoken commands.","Netflix should group movie series like TV shows. That way, it's a lot easier to binge a movie series.","An NFC integrated paperless receipt technology/POS/App","You put in your info and credit card companies make you credit card offers","A microwaveable lunch box that steams your food.","A website where your family stores \"Safe\" videos of family members describing themselves. Then your descendants can see videos of their ancestors.","Community coin: A currency for community services","A special iPhone dock on your dashboard which starts your car's engine when you snap your phone into place.","Eliminate Wifi passwords by creating an app that limits wifi to the geographical area that you decide.","Amazon should allow selecting a delivery date so that your delivery arrives when you are back from holidays e.g.","What character do I look like?","Tourism site where locals can give their advise for places to visit in a state or country.","My suggestion is to create new way to monetize content on the internet","Write messages in space (e.g., using mirrors in orbit) that are unflattering to North Korea so as to convince it to give up its nuclear weapons.","Google Maps should send me a push notification if I get close to a place I added on my \"Want to go\" list.","Lottery credit card.","ask google now \"where's my car\"","Someone should make a dating app for redditors that anonymously compares subreddits and comments.","An image search on dating sites..","Facebook should use Googles search function. I never find what I search in the timeline or in groups","A filter on Facebook that removes posts from your timeline that include keywords of your choice. For example, \"Game of Thrones\".","Reality show that teaches homeless how to survive in wilderness","A social networking type of app where all you upload is a voice note","An animation channel on YouTube that animates stories from Reddit comments.","Twitter 'time machine' - A way to go back in time on twitter and see how posts popped up at the time","Movie Theatres should make Popcorn in Partial Vacuums to use Less Corn","Extremely wealthy people should have \"modest\" backup homes, vehicles, and clothes so they can Test new friends and lovers. 'Do they only like me because I'm rich?'","Rotten Tomatoes, IMDB or Netflix should let us filter our movie search by RT score and Box Office take. Then we can find highly rated films which we missed because they didn't have huge releases and press.","An independent organization that gives news organizations accuracy ratings. Annually they'd crosscheck facts from 100 stories published by the news outlets and give them each a rating.","Why don't we auction off all those Confederate memorials?","Abolish Columbus Day and recognize Election Day as a federal, state, and municipal-level holiday.","Physical Movie Theaters for Netflix","An idea for a device that can stop many large trucks from being used in terrorists attacks by reprogramming the Black Box present in every truck","Have special signs for 2 person tables at cafes and coffee shops which indicate that you're alone and \"cool\" with another solo customer sitting with you.","A workshop you can get a subscription to and have access to a full workshop and rudimentary materials.","Hair salons and barbershops should always offer complimentary breath mints. Then the stylist or barber doesn't need to suffer bad breath from customers.","Businesses Should only use 5 Second ads on YouTube, rather than anything longer.","There should be mirrors behind or to the side of photographers for portraits or school pictures.","A site for compiling all live mentions of a topic from various sources.","Live Band Karaoke","Somebody should open up a k-pop karaoke bar called Seoul Music","A F2P competitive game buisness model in which the only thing that costs money is the ability to play Ranked mode","Pokemon Go but Pokemon are only at fitness centers and only if you've been there for 40 minutes","A online multiplayer version of 20 questions.","A website where one person creates a fictional universe. Afterwards others can submit characters and storylines that take place within it.","Domain hosting providers should take down harmful pages spreading viruses, malware etc","X-COM-like game where you play as Hitler's bodyguards and you have to fight off time travelers and reverse-engineer their weapons.","A store that makes things cheaper the more items you buy.","Max charge / Best charge switch for any device with a LiPo battery","FDA should offer an \"A, B, C\" Accreditation System","Instead of affirmative action, how about a broad stroke policy across the low socioeconomic class. This way you have a perpetual force bringing the people on the bottom up. Also doesn't undermine any race's achievements and removes the race issue.","Instead of taking down Statues and Monuments that have been deemed controversial, move them all to a park.","Make a statistic what lead to most positive changes globally in history: Elections, Demonstrations, Petitions, Wars, Protests ..","The \"external pinioned maneuvering system\" for automobiles.","Prevent elbow wear and tear in button down shirts with a non-visible, removable patch","An app for tablets with a stylus that recognizes shorthand","You should be able to choose a GMaps/Waze route based on safety/accident history on those roads","Bacon in zipped plastic packaging","Place to organize one-off skype group chats for books that we love.","Casinos should invent a card game that you have to be a card counter to be any good at. Then card counters will compete with each other to show off how good they are, and leave the other games alone.","WhatsApp / Messenger et al should let you send a 'silent message' that doesn't cause the recipient's phone to beep","A marketplace for entrepreneurs and investors to buy and sell businesses!","Portable thermostats for air conditioners and heaters","A competitive league (any sport) where players must genuinely hail from the franchise's city.","Could we use high-altitude balloons to provide outside internet access to North Koreans?","A life jacket (flotation device) with a built-in camelbak","Drones that cannot be shot down by the enemy because doing so will result in a nuclear explosion.","Youtube should have an feature to sort comments by oldest first.","A pen that shows its \"mileage\"","Would it be possible to make a high revving washing machine?","Turn in Pension Cheats for Ca$h","A Reddit clone with all non-[Serious] replies removed.","A calendar aggregating app that dedupes events","A battery charger that charges a battery from the residual charge of other batteries","Floor pedals for toilet seats so you don't have to touch them to put them up when you pee and they go back down automatically when you step away.","Google or some other large company should donate a ton of money to secure wikipedia for ever","Submit GPS/SNR/Tower information to 911 as a databurst similar to how 56K works on a higher frequency","App for Filmmakers/Youtubers/Commercials","An online dating service for specific political affiliations.","A button on your tv to make the remote buzz, ring or make some sort of sound.","A New Online Acronym: TFITS (it stands for \"the fuck is this shit?\")","An umbrella that would automatically point into the wind no matter how quickly the wind changes directions.","Some voice recognition software to read your voicemails and send you a transcript over text.","A snopes chrome extension which automatically scans fake news memes on facebook and gives a rating.","An indie video game about a child waking up in an incomprehensible parallel universe before their first day of kindergarten.","Automated drones to replace waiters. You sit, order from a tablet/your phone at the table and quadcopters fly your food over from the kitchen as soon as it's ready.","A desktop app that lets you click on any window (ex. a file transfer window) and be notified via text/popup when it disappears or closes (i.e. finishes)","Automatic, steam powered, BBQ Hot dog roller.","Every fire station should have a public restroom, for use by anyone, especially the homeless. When needed, it can be flushed out with a firehose.","A reddit \"2.0\" that only allows user sign ups if they have an original Reddit account that is at least a few years old.","So I was thinking...","A modern, darker Bionicle Movie","Scummy bears, random flavors like beanboozled or Bertie Botts every flavor beans.","Low-Level Nuclear Waste","A gym tshirt that changes to a completely different colour with sweat","Airlines should have to comp you for significant delays.","A website or service that dumbs down research papers so everyone can understand.","[NSFW] Instead of using barbs and blades to prevent rape, there should be a wearable device that tasers/electrocutes rapists.","Instead of forms asking for sex or gender interchangeably they should ask two questions: What are your sex chromosomes? and What gender do you identify as? (self x-post r/showerthoughts)","A system that notifies you when an unreleased song/album is available on your music service","\"We're a team of students at MIT looking to connect people with ideas to create real companies\" To all of you who were interested in the original experiment, here's the beta website.","Rotten Tomatoes for Identity Protection (MBA Program Project)","Youtube comments that scroll independently of video","All bookstore customers getting a free extra book, with each spread having the first two pages of a new novel just out.","Want a million bucks? Make a Fidgit Spinner with an odometer.","News Accuracy Meter","A site/app for crowdsourced retail prices","Game idea: 8-bit style game about rockstars that were possessed and their souls were taken","New position: Citizen Advisor","What's a good way to record Private Predictions?","Automatic two factor identification on password related email.","App that keeps track of TV series that you watch","Autocomplete while typing for PCs","Polymorphic 3D computer","A Subreddit like r/Lightbulb but only for politics.","A supplemental rating system for movies and television which focuses on the degree and explicitness of violence against dogs.","Web Browsers should support tab hierarchies or tab groups","Extension that automatically delays my Reddit posts until more active hours, because nobody sees the posts I make at 2:00 AM","Shelter gift cards for panhandlers","Photography technique","An interactive choose-your-own-adventure TV show where the outcome of next week's episode is based on viewer voting popularity","A new character for rhetorical questions","Subreddit idea","Idea for a show: The Bender","Dental assistants should actually watch clients brush and floss. Then they can correct bad techniques.","Rather than crutches, create a simple exoskeleton with springs to support seniors that have difficulties walking","For every subreddit that is heavily censored by mods, someone should create a free speech parallel subreddit where bots duplicate every post except there is no \"echochamber\" effect in the comments.","There should be a subreddit where people argue opposite sides of what they believe in.","crowd sourcing company where money is completely accounted for.","A video montage illustrating Inflation in America using historical Price Is Right clips.","architectural game in wich your houses can collapse in slow-motion if built badly.","Gastric juice resistant D-Mannose pills to fight EColi overpopulation in the bowel. D-Mannose usually does not reach the bowel, similar to water.","A text search function for things spoken in youtube videos","Real life \"Pokedex\" app","Gasoline Moisturizer","A bed with integrated sensors that checks you health thoroughly over night and notifies you in case there is any issue","A Spotify watch","A new political party called The Birthday Party, with the rebirth of the country as its goal.","Todolist software but it will lock your computer for set time or until task are completed.","Location based social media app","PoliSpectrum - A website to give readers a holistic review of critical issues in politics","Gym motivational membership!","Competitive photography shows... like Chopped, but for photographers instead of chefs.","An annual baggage pass for frequent flyers of airlines that charge for bags.","When calling people who have like 5 different phone numbers, have an option to call all of their numbers at once","Make an info page summarizing common medical procedures with given medications and sketches what is done as well as a risk assessment","Two-factor authorization API using facial recognition","Develop a 3D display that lets the eye focus in distance to avoid short-sightedness from smartphones and Computers","Connect the central heating of a brick house with the weather forecast to start heating in advance before it gets cold.","Secure anonymous file storage/hosting?","Newsletter emails should have a certain tag of some sort to make it easier to seperate them from important emails","Email your congressman made easy","Automated load out trailer (or truck)","An Idea I came up with to get around the legal gray area surrounding fan edits.","Hotel &amp; Store Fixtures","Extra-curricular Education/Skill Service","Bathroom Yelp","A movie idea about a break in but the person getting robbed is holding money for the mafia","Netflix should provide a discount for people over 40 since they get tired more easily watching shows/movies than listening to audiobooks (as vision takes a huge amount of processing power in the brain) and so Netflix has less value for them.","A fantasy videogame/TV show like Game of Thrones but set in a Wild West era, not a medieval one. Cowboys instead of Knights. Revolvers instead of swords.","Digital assistants should change the tone of their voice depending on the device volume. If the volume is high, they should sound like they're shouting and if the volume is low, they should whisper.","Breast implant vending machine","Create the ultimate WW2 game","Homeless person company?","Birdseed that doesn't cause a fresh crop of weeds to grow under the feeder.","Summer men's underwear idea","Instead of juries being randomly picked so any person can take part, have those who actually want to join sign up for it and be forced to take a test on various subjects so juries make informed and correct decisions. Also, have them get paid for the trouble (if they don't already)","An idea for a drinking law that we could all support.","A site dedicated to reviewing phones after 1 year of everyday usage.","A life online dashboard","A music player for PC that self adjusts the volume of the music to blend in with the videos(like boring lectures) in real time","There should be an art competition where contestants are given weird objects and colours to paint/draw with, and they must draw something creative/in a category within a set amount of time.","Advanced Find Text options within browser (see picture)","Nonpartisan political activism website for busy people","Require student loan applicants to show they have an idea of how to pay the loan off, like we currently do with business loans.","The Meme Stock Market","Is this a good idea? If yes, is it in the realm of possibility?","Gas station pumps should ask all their questions like \"receipt?\" and \"car wash?\" while you're pumping instead of waiting until after you finish and holding you there.","A Mythbusters-style show for testing the claims made about infomercial products","Railroad crossings should have large timers that countdown how long a train will take to pass","A law to stop unsolicited sales calls and mail.","A site to build your own smartphone","A gay club and German restaurant called Sausage Fest","Incognito/In-private mode for media player's just like we have for browsers.","GUI for Elders","Credit cards with a robbery pincode","Kick Out All Illegal Immigrants And...","how about a website that takes the amount of time you spend on the site and compares it to other people around the world, with the objective of staying on the website the longest. whoever has the longest time after a month wins a prize. have a bunch of ads on said website and make tons of money","Hey Reddit, we're a team of MIT students looking to connect people with ideas and skills to create teams for real companies.","URL treasure hunt","A phone with a physical switch that turns off the camera and mic","A simple job where you get paid instantly, whenever you want","A brand new kind of mobile device","News websites should keep the identity of the people in their breaking news articles secret for 10 days, that way initial judgment would be made based on actions and not political party, race, prior history.","Build a Beer","Name newspapers after the largest stockholders residence. For example, the New York Times would become the Mexico City Times.","A quiet \"cellphone\" room in a bar/restaurants.","Online platform to validate ideas","A subreddit for non artists to submit cartoon ideas.","A beauty supply company should make a hair dye marketed in LGBT shops around the world and call it \"Pray the Grey Away\".","Extension that automatically shortens the URL in your bar to the shortest possible version.","Mobile phone screen without backlighting like the gameboy color and gameboy advance! I want to be able to play games and watch movies in the sun!","A precursor to self driving cars, a car that knows the current speed limit and helps you avoid breaking it.","Toontown Part 2","Dual gender soccer tournament","A documentary length episode of How It's Made, following one product (a car, for example) from the original mining of materials through production, and showing how every related thing is made, even the machines in the factory, the plastic refined from crude oil, the wiring, everything.","A Memorial Day for scientists who died to further science.","A YouTube channel where you can vote on Simpsons episodes.","Putting value into video gaming.","Video '\"previously on...\" recap idea.","A site comprising of a newsfeed purposefully generated independent of political views or geographical location and, separately, articles selected independent of personal viewpoint expressing a range of well-written views from think tanks and other such organisations.","A website where everything has a set price, but you spend a percentage of that price to get an equal percent chance to \"win\" it.","Pressure sensitive keyboard that fails to detect presses if they're too hard, to train you not to type too hard.","Petsmart &amp; Petco should have a microchip scanner built into the exterior of their stores, so people can scan pets they find 24/7","Apple Airpods should be turned into dangling earrings when not in use","People who fight animals should be forced to become gladiators","Smell Museum, where you can efficiently sample many, many different smells and find the ones that trigger distant memories and emotions","I call it *MySide*, a secure camera that operates from 12v port in a car dash to respectfully record interactions like traffic stops or road rage without shoving a phone in someones face","Someone should make a multireddit with the suggestions from this thread, https://www.reddit.com/r/AskReddit/comments/6n73th/what_are_some_great_subreddits_whose_names_cannot/.","Use X-Plane's flight model visualizations in real-life to show passengers the actual forces acting on their plane in real-time — and therefore make their flight more interesting and educational.","they should play music in bathrooms so that you cant hear other people do their business","Turn Your Smartphone into a Mouse [App]","Create a law where it is illegal for companies that use prison labor to discriminate against ex-cons.","Kensington dock","Satire","A website where you can request and offer everyday services for cheap prices.","Use punch cards to vote.","A service where you can request a large download be done, then mailed to you to save on bandwidth.","Listen to the same music in a phone call with someone","Snack cap waterbottle","Electoral poster","A beautiful online obituary, where loved ones can LiveOn forever!","Automatic kettle","Simple idea to reduce the number of fatalities from altercations between armed police and knife wielders.","Laundry detergents and dryer sheets with a masculine scent","When you get food delivery or take out for your weekly binge eating session, prepare your eating station with a large unused trash bag. Open it up wide and set down all your food onto it. After you've gorged yourself simply pick up the sides of the bag and throw it away. Easy clean up.","A web service that flags misleading sales and information on Amazon","Looking for idea for game","Reddit feature that masks the name of all subs on your homepage you can click on things and be surprised by the pic/video. Otherwise, the sub name can be a spoiler.","Spacehenge: an orbital sculpture to unite humanity.","A nut and bolt for toilet seat that won't break","A website that tells you the hottest issue of any country on a give day.","What kind of lightbulb do I need here? (please i have nowhere else to post this)","Looking for a feedback! Microcromo the first transformable coffe table.","Comedy is that which both totally shocks you and doesn't surprise you at all.","A flight simulator where aliens have limited air travel on Earth to an altitude determined by the 3D convex hull of the Earth and today's buildings.","Take Out Cooking Show","TLDR News","A rollercoaster with multiple possible routes of different intensities","Purple News","A game where you get a prepaid card, put as much money as you want to spend, then get almost blackout drunk and go online shopping.","A website where you can meet other lonely people in your area and go do an activity so you aren't alone","A search engine for movie and video game critics.","There is a special computer mouse that hardcore programmers use and I think I have an idea for a better one.","Shots and Shots: a casual paintball tournament where teams are given shots/shooters to drink between rounds.","I recorded EVERY drink I had in college.","A website where you input all your skills and hobbies and it recommends you a job","Every device now has driver on memory chip where it connects.","A website that calls out other websites for unusual \"Not found\" handling","I found an alternative horoscope where the constellations of our ancestors are felt by us through inherited hormones that are triggered by melodies around us","Zathura: The VR game","A Netflix style subscription service for news. For a monthly fee you get access to multiple, quality news sources- we get better informed- journalists get paid- no more click bait!","An idea I will never pursue .................","A beer called Yard's Ale.","Free bungee jump or sky diving for suicidal people","A professional wrestling ring with the floor being a massive display that displays iTunes-like visualizations based on \"3d touch\" inputs throughout the ring floor.","Link songs in your iTunes or Spotify so they play one after another, even while shuffling","Develop genital protectors for skaters that like to train on handrails","A site that can tell you how loud a sound is (dB) by tuning to your device or headphones","App to break cellphone addiction","Making Vr cheaper with wii","We need an \"Arthur\" show for teens or young adults.","Fuel Economy of Planes","An FPS game where you have time to react to being shot, and the gameplay revolves around the fight instead of the part in between","NBA 2K esports league running alongside the \"real\" league.","Test case repository","Custom printed car owner manuals that only talk about the options you bought","App stores should have free trials","A clipboard shortcut key which swaps the selected text for what is in the clipboard","I added a permanent VISE to my truck.","Idea related to lakes and oceans: ]","\"What Not To Wear\", but for singing.","A chicken strip on a stick covered in corn dog batter","wow, a place for crazy wild eyed idea people? excellent, we need this, stat.","Product Placement in Fireworks Shows","Cars should exchange GPS position data anonymously over a global system to avoid accidents","Cat Burglar: a video game where you sneak into homes and businesses 'Metal Gear Solid' style and steal valuables. Texas is the Final Boss Zone.","A war game where you control remotely controlled *missiles* and are given precise targets to hit.","Two-person Bluetooth Headphones","There's a Stan Grossman credited in the Golden Girls, and Stan Grossman characters in Little Miss Sunshine and Fargo season 3.","First Bitcoin crowdfunding for Italy Earthquake with blockchain transparency","Water Drone","Websites should make a practice of putting the 'Remember Me' Button clickable *AFTER* logging in.","There should be suicide crisis centers where suicidal people can go and be cared for anonymously. Nobody needs to know you need help, but it allows them to drop out and gather themselves.","Oklahomas football motto should, be \"the Sooners the better\". Or something,","The Insomnia TV Channel","Trash cans should come with sticker for \"Trash,\" \"Recycle,\" and \"Compost\"","Instead of giving someone Reddit gold, make a donation to charity in their name.","Create a prequel to \"Video Killed a Radio Star\" in the style of Falco and call it \"Rock Me Radio Star\"","A door to door salesman that sells actual doors.","Take a recipe or several I find online and have a cart generated to pickup via Walmart Grocery or similar service.","Markets should sell food made with the products they sell","Airlines should partner with Netflix and offer the entire international catalog","Americans should be able to debate directly with powerful politicians on national television","GMAV, Global-Media-Audio-Value","Popeyes restaurant chain should serve, spinach.","A video game that alternates between SameGame and Tetris levels where regions removed in the SameGame determine the \"drop regions\" of those colors in the next Tetris level and where the lines removed in the Tetris level collectively determine the grid cell colors for the next SameGame level.","A video game that alternates snake and pac-man levels where your snake path determines the maze for pac-man in the next level and where the locations where pac-man eats ghosts determine the locations of food for the next snake level.","Prizes for doing good deeds or being a nice member of a community (maybe voted on by the town/district) should be awarded in court rooms, so that judges, lawyers, and police officers can get to see the good side of humanity too.","The FDA should carry out studies that compare the effectiveness of home remedies to common medicines","A List App that emails anyone the list.","Lawyer fees should only be as much as the lowest party can afford.","External Auto tapper for mice/phones","Stickers on fruit that detect sugar concentration of the fruit and change the color of the sticker accordingly. Unique tones once it is underripe, ripe, and overripe.","An app that at set times or random or both asks a question.","IOT used things","Two tv shows that air at the same time, with the same story, but one is from the good guy's perspective, and the other is from the bad guy's perspective. (x-post from r/crazyideas)","They should make a TV series sequel to \"House\" in which Dr. House is serving time in a federal prison and working as its doctor. The name: \"Big House.\"","Jugglers","When someone uploads a newer version of a video on YouTube, YouTube should have a \"there is a newer video available\" link, like Amazon does for products","Tattoo ink that blocks UV rays, preferably clear.","Friday the 13th got a game. How about \"The Shining\"?","Fast food companies should use their advertising budgets to randomly pay for peoples food.","A new version of Monopoly","McDonald's should record and save all the voice files tied to the completed order to automate the drive-thru process with voice recognition training.","Expand the notion of \"creativity\" in high schools by replacing the fine arts with subjects that are also creative but may not be thought of such by most people (e.g., game design and development).","A website where you plug in your first name and it tells you songs that have your name in them.","A school where students don't learn subjects and don't sit for tests, but instead they prepare for and enter all sorts of competitions all year long","Lego conversion software","Make politicians create and sign a contract between them and the public about what they will and will not do, and kick them out of office if they break that contract.","Develop cryptocurrencies that do not waste massive amounts of energy for mining","Need city-based (Nashville) slogan for t-shirt - funny, unique, trendy, anything! Will send free completed shirt to best ideas.","Why don't we email our receipts instead of printing them out?","\"10 seconds of water\" button on the fridge door dispenser.","Wireless earphones that can also work as a hearing aid thus making it impossible for people to know whether you are using a hearing aid.","The wordcheck function doesn't work in all incidences in-browser. I'd like to open a new tab and have a text box that I can use to check my spelling, and then copy+paste into where I need it.","Emergency response, accident prevention","Google should have a tuner online, since they added a metronome","Joggers on Twitch Smartphone App","Reboot Lone Wolf &amp; Cub as set in the old west","a new art form","A PLATFORM 2 SHARE/DISCUSS IDEAS IN THREAD FORMAT","There should be an oboe that is designed for marching","E-cigs should slowly lower the amount of nicotine in the vapour to wean people off of it.","Public and private WLAN Routers should be able to handle mobile calls optional to reduce the overall radiation and improve connections","Netflix should have a button so you can thumbs up your favorite parts of shows","Monster of the week twist ending idea.","Android should automatically install Apps to the SD card when necessary rather than complaining that the internal memory is full and preventing the Installation completely","Automatic Time Tracking with Analytics","A way to make funerals much less expensive.","We should have a Reddit convention","Companies that make a profit by selling our personal data while offering their services for free, should let us pay a subscription fee in return for a legal promise not to sell or give away our data.","Someone should make a WSJBot for Reddit that automatically so I don't have to pay to view Wall Street Journal Articles.","Self Igniting Fire Staff, or Torch","They should have a short story dispenser in bathroom stalls that print a story on toilet paper. After reading, wipe, then flush. I would legit pay for this in places.","Evil does exist","Privacy tips which are efficient, understandable, easy and effective.","Automatic Water Dispenser - For Toilet Stalls","Youtube removed videos should provide at least the title, so I could fix my music playlist when a video is removed","Privacy tips which are efficient, understandable, easy and effective.","An enhancement in reddit-process using UI.","Socks with holes to prevent Athlete's Foot by increased air flow. Works - I tested myself","Opt-in feature for smart phones: When a call comes in with a number not in your phonebook the phones should look up that number's \"telemarketer score\" based on other people who've also received calls from the same number.","A website where you can upload a design and then they mail you a temporary tattoo version of it so you can wear it for a few days before a lifetime commitment","Mobile phone roller ball scroller that generates electricity to charge the device?","Create a sub like r/lightbulb but with ideas from r/lightbulb where the idea came to fruition.","If autonomous cars observe significantly unsafe driving, such as someone swerving across the road, they should automatically report the vehicle details and direction of the suspected drunk driver to the police","An app that blocks emails/calls from work on certain days so you can enjoy your days off.","A movie starring all the epic old dudes","Develop a spectrographic toxicologic quick-test for food, so you can figure out the amount of antibiotics, pesticides and more","An app to save kids from being left in hot cars.","A subreddit/website/thing where you send interior designers/decorators a picture of your room and they give suggestions on how to make it look better in how to arrange things. Kind of like Pimp-My-Room.","People would totally buy icey cold electronic fluffy pillows.","A button for when you hang up that makes it sound like your hanging up a phone really hard.","A playlist feature for Netflix/Hulu/Prime!","Acceleration of ameoba in a particle accelerator?","Underdog Academy","A Guild App","A browser extension that let's you select a page element and \"Prioritize\" it. Then, when loading that page in the future, the browser makes it so that element loads first and *stays*put*on*the*screen*, preventing it from moving all over the place while the rest of the page loads.","Instead of making massive datacenters and paying to cool them, give people free electric spaceheaters to poor people contain a running cloud server inside, and refund them for the power it uses. Free cooling and lowers people's electric bills.","Cereal Milk Flavored Milk. Sans the Cereal. Cartons of milk preflavored with sugary cereal goodness.","A paper-thin GPS tracker that is built in to cardboard shipping boxes so parcel companies have more accountability for \"lost packages.\"","A modern reboot of Space Ghost: Coast to Coast would do great as a Netflix show","Now that we're in the age of IOT, time saving devices ought to provide a report of how much time they have actually saved using them, as well as how much time you spend fixing/maintaining them.","Find me a newsletter","A new way to set laws without the need of political parties.","How can you use magic wielding battle nuns in warfare?","Google could use its face detection algorithms to search for missing persons in the background of every photo users have uploaded.","Change up what democracy looks like","Group Chats should have polls for decision making. Oo wait I just made an app that does this called Majority check it out.","Improved Tabs for Browsers","Websites doing \"solidarity\" for Net neutrality type deals could have a script that makes their site load up like it's dial-up speeds, with an explanation afterwards.","Block chain for news.","Chrome extension that automatically removes affiliate tags from links when you follow one.","Instagram should let you follow a hashtag or a location.","Attach a ballooon to a Caravan and rent it out as flying Hotel","A wireless barcode scanner connected to each register so that if someone needs to go back and check a price, it can be immediately be added to the order without waiting for them to return.","FidgIoT","A website where you can search for a song and see what movies and tv shows that song has been in.","Jelly Socks for soldiers that patrol the jungles","Resolving our Dehabilitation Prisons","[REQUEST] I am looking for a mobile app project idea.","Random Restaurant","Incorporate sound hound into Spotify.","Phones should have the option to \"Add Temporary Contact\" for when you're buying something off Gumtree/Craigslist or you have AirBNB guests","Make a Website where ppl can offer all services they have. Basically all social sites like uber, Airbnb,ebay, eatwith and others in one","A personalized dictionary that tells you whether a word is important enough to know given your life goals.","A multiplayer game that trains a deep learner while you play. When the community eventually left the game, use AI to let people keep playing.","You’re a citizen of a country. You are one of the only people who knows how to create and manage a website, but everybody has phones. Your goal is to get the government overthrown and you run it.","The \"Siri\" of home cooking and kitchen automation","add email info to debit/credit card to receive directly receipts to your inbox","shoes that generate electricity every time you take a step","Local/Regional Based Streaming Service","Choose your own adventure style books based on trivia questions. Wrong answers throw your story for a loop along the way.","Make the curbs outside of bars from playground rubber padding instead of concrete.","Make sugar pill weeks for birth control pills be iron supplements.","Web enabled vital monitoring at hospitals","GTA Breaking Bad","A \"report grammar\" feature for reddit that you can use to inform the author via private message that you think there is a grammar error in his/her submission. You can turn these messages off for a particular submission or for all of your submissions.","A way for an elevator to know that it's full so it doesn't make unnecessary stops at other floors","To raise money for charity, someone should produce a parody of the news 24-hour news networks written and performed live for an entire day.","Get mate rates and staff discounts for everything you need","Make a Browser-Extension to quickly share links in your favorite Subreddits","Videogame boss idea","Robotic house-plant platform for automated maintenance","Make all high school grades based 100% on class participation.","A Game in which everytime you die you go to another \"dimension\".","Make Die Hard into a 3D video game animation of every single person. So that you can zoom in​ on and follow the individual terrorists or whomever you like.","There should be more precautions in microwave ovens.","The Graphene 'Waterwheel' for blood filtration","Great ideas for gamers.","There should be a \"top since I was online the last time\" option for browsing reddit.","Computers, smartphones etc should automatically converts any time mentioned in emails, IMs etc to the local timezone of the recipient","Smartphones and laptops should glow a color that tells strangers nearby how much brainpower is currently required from their users (e.g., red for computer programming, yellow for reading an e-book, green for browsing Facebook, etc.).","Google Maps should be able to find the fastest route that avoids intersections that users want to avoid.","The next guitar hero or rock band should have a karaoke mode where it doesn't mater how many notes you miss.","Permanent /r/place website.","Youtube channel where someone gives an enjoyable explanation of any random Wikipedia article.","a subreddit called r/epresentationalistic - just to get a 21 letter word in the name","Big Pharma should pay compensations for all side effects depending on a govt issued table, without the requirement for a lawsuit","Distinguish todo items from appointments/deadlines in your calendar by putting todo items in the past with higher priority ones in the more recent past (e.g., yesterday).","a button on your tv that sets off a sound on the remote when you can't find it anywhere","Develop mobiles with two displays. Common on the front and a passive on the back, for reading ebooks or under bright condition","A very shiny photoframe; so you can see who is creeping up behind you at work","A fried chicken food truck that is only open on Sunday and parks in front of Chick fil a stores","Give the Moon rings like Saturn by using powerful nuclear explosions to launch billions of moon rocks into orbit.","A bed that goes from soft to hard when it's time to wake up.","A browser extension that would tell you if a link is dead/broken before you click on it","A Color E-Ink Retro console portable","A company that uses a website to bridge the gap between inventor engineer, and manufacturer. Then using the provided network to help the inventor make up a prototype for further experiments, marketing, Kickstarter campaigns, etc...","A search engine that finds products sold by shops in your area.","What to do with a working sink in the living room?","Subreddit for Language Learning/Teaching","Spotify more like Youtube...","A-B-C-D keyboard","Connecting Number plates to bank account","Bikini Pool Maintenance","Crowdsourced live video sharing.","A website that shows past and future climate change predictions and whether or not they've come true","Matt Stonie and Epic Meal Time should make a crazy collab video.","A separate line in restaurants or other establishments for people who already know what they want","Video games should try to include advanced vocabulary as much as possible so that gamers will be interested in familiarizing them.","I need help getting exposure for a newly patented device that can save 10-30% energy consumption for induction motors","A television news network that focuses on the good things happening locally/regionally/nationally/around the world. Kind of the opposite of the news that is on currently.","A subreddit like /r/changemyview except you post things you have no opinion on the subject and people from both sides try to win you over","A netflix type subscription for gaming apps","Americans who think global warming is bad should be required to spend a winter in Canada.","Crowd fund a Tesla solar power station installation for the residents of Gaza","Give fast food chains the ability to amend those annoying digital-screen menus when a product is not currently available.","Lessons, courses, and tutorials online, by people for people.","An output valve for regular plasma and blood donors","Someone should make an American version of Goodbye Lenin","Combination dating site and gaming lobby","Colour coded emails dependant on news of content","CrowdFunding site but instead of money-people contribute and instead of rewards they get % of income","Replace wheelchairs with \"wheel water tanks\" where you float in the water and \"swim\" in place to move the entire wheel tank around.","Charging cables with swiveling ends.","Apps/ websites like Trulia and Zillow should have a comments section.","Flavored whipped cream","Death FAQ website","Time limit on text messages/emails","A pedal on each side of the toilet that you can press with your foot. One to raise up the seat and one to lower it.","How about a bot that tells the exact time passed since a joke was last used, or would that annihilate r/funny?","A chatbot for career advice &amp; opportunities","Google Photos and Apple iCloud scan incoming photos for missing children using facial recognition algorithms","Use of Google searches to predict text on Gboard","Much easier email verification using a Chrome extension","Require amazon listings to feature a \"Scale\" photo that demonstrates how big an object is.","Cars should be able prevent death from overheating","Pensioners and the unemployed should be banned from the Post Office, Bank etc until 9am so people with work that day can get in and out fast.","Live cam billboards around densely populated areas of every major capital city showing footage of polar coastlines depicting pieces of ice continually crack and break away from our polar ice caps to remind us about the impact of global warming and to go that step further to rescue our home.","Cryptocurrency charts combined with corresponding articles","Develop lightfield 3D cinema, so ppl can focus any point on the screen. Currently the focus is fixed to the camera's focus that took the scene","A shower head with a built in soap/shampoo sprayer mechanism would be a great idea.","A solar powered machine that separates carbon dioxide molecules into oxygen and carbon","An option to sort a subreddit's posts by the number of comments","Simple webtool for users to find a compromise","Let’s play a game – THE WHITE DOT.","Dayplans - Paid day trip platform","Cell phone video should be disabled in portrait mode!","Software to replace sounds in-game with your own?","They should make a Kindle that changes the cover so people can see what you are reading.","Guacamole in a squeeze package","What software product is not invented yet? (need an idea for app startups)","Innovation or invention?","A website that pays you for your awesome ideas","A remote controlled segway with a Streetview-style camera and mic/speaker attached that lets you use a VR headset to \"tour\" cities live.","YouTub (or any video) captions on Reddit posts bot/service","An FPS \"swap gun\" that lets you swap positions with any enemy that you can \"shoot\" with the swap gun.","clothing for blind people","A website where users could upload raw footage they shot and editors could download and edit it into movies","A baby sitting service in the theater so people won't take their young kids into rated R movies","Fully autonomous cars are years away, but wouldn't it be prudent to immediately begin installing camera/sensor systems for emergencies or drunk driving?","Meta search engine that functionally works!","A news web site where every element of a news story contains links to source material which justifies that element.","A credit card specifically for signing up for 30-day trials.","An alternative (verified) product review website","a portable waterproof shower blu ray/dvd player","Chrome extension that hides shittymorph's comments on Reddit","A website which will hold a comparison of sizes of shoes and clothes","Simple product idea - kinda silly - kinda NSFW - preys on classic male insecurities","Plastic Lace Shredding Recycler","A name for a brand of vegan faux meat: All Filler, No Killer","A website where you can purchase ideas","Call for Ideas","Some new superhero movie should finally parody the 'giant climactic sky beam' trope","A browser extension that lets you control volume with the mouse wheel whenever a video is playing in fullscreen","Someone please make a chrome extension that automatically redirects to you the YouPak.com link if the YouTube video isn't available in your country.","All foreign aid should be on an individual person basis like an international basic income.","An 'acknowledge' button in email","Use \"M.\" as a unisex alternative to Mr., Mrs., Ms., and Miss","[Reddit] Probably no one important will see this, but what if when you hovered over usernames it showed you the user's \"home sub\" that they \"represent\".","Stores should email a copy of all your purchase receipts to your credit or debit card company so you can see them online.","An app that can identify when someone is being sarcastic on the internet.","A company that will return all spam advertising you've received in US Mail, to the sending company, preferably at the sender's expense.","An FPS where all the bullets are slow and make a sound so you can avoid them (without slowing down time).","News sites should use a green to red color scale for level of proof. Full green = confirmed story. Full red = proven take.","We should all be more like \"opposite\" George Costanza...","There needs to be talent managers for people with anxiety who just want normal jobs","How to Civilization 101: what high school curriculums need","Drone Airship idea","'Follow' function on Reddit threads","Make people spend more time with their dogs. Kenticc energy charging Barrty bank","3D Printed Hand \"Tendons\"","Interfaith Penpal Subreddit","I want a doll/figurine inside a stiff gyroscope","A chemistry-based web comic called \"Elementary School\" where the chemical elements are personified in a high-school type setting.","A declutter service that hauls your shit to storage, photographs everything, and provides online access to your catalog.","Google translate should have IPA as a language.","Fidget spinner with a small display showing spin count.","Whoopie cushion should team up with a dog, chew-toy company.","Recycled Bullwhips","End of year Spotify statistics should show how much money you made each artist","Looking for Daily Idea List Topics","A webpage that lets you customize what list of search bars you want all in one consolidated page.","A bot that posts all the mainly posted answers for every common AskReddit thread.","A community dedicated to subbing videos in r/videos for deaf or hard-of-hearing.","Fiber optic lighting office buildings","A chrome extension that has a one in one-billion chance in every second of a YouTube video to play a jump scare for people who like to live on the edge","A screenshot app that would remember which app you took a screenshot of, so that you can search by app","Real questions fake answers subreddit","Bottled tap water at the same price as other bottled water but all profits go to WaterAid","Biometric scanners for putting vehicles into drive or reverse.","Let companys pay compensations annualy for environmental damages that destroy us and our planet (deforestation, overfishing, pollution, damage to health, ..)","A sitcom called the unflappable Sally Yates set in the 20's where the lead actress is a flapper lawyer.","A method to detect anyone that walks into a section of a room to trigger a notification.","A Fidget Spinner toy that shocks the user.","A pensioner-like card that verifies you are homeless/in need, and gives you discounts at participating facilities or for essential items (e.g. gym memberships, toiletries, clothing, e.c.t.)","A Chrome extension for Netflix that links you to the reddit discussion thread for the episode or movie you just watched","Alarm Clock That Can Mimic the Temperature Outside as You Wake Up","I should be able to filter my upvoted posts and comments by subreddit","Require lawmakers to pass a test regarding what's in a bill before being allowed to vote on it.","A device for grandparents that only runs Skype, that can be controlled remotely.","Since they can't get enough of them, movie studios should start making remakes where the villain wins.","r/movies should open a non-spoiler discussion for movies where people can ask about whether or not it is worth seeing.","Netflix, or some other media company should do a series based in the Half Life universe","One Million URLs","Airline travelers should be allowed to buy two seats next to each other and sit in BOTH of them, with a butt cheek on each seat.","Cheetahs should be (re)introduced to north america - after all, they evolved there!","Airline travelers should be allowed to buy an extra seat and leave it empty, put a lap child into it, or do whatever the fuck else they want that doesn't interfere with the flight.","App where you can sell your driveway space for parking","Time of death countdown for shelter animals","Hiring people to stay in small stores with little to no people to encourage new, real customers to come in.","Force the schools with 5 billion in funding a year teach every student from k-12 medical and body knowledge. To make sure there is a lot more healthy people out there.","Pay actors to compliment you","Hide a digital signature in your handwritten signature so it can't be forged","Stopping web giants poaching news media ad revenue","Imagine what the world would be like if every person did one simple random act of kindness.","Facebook should have a \"missed connections\" feature. They are the only service that could get it to work because of their broad membership base and phone app."]
